app/controllers/tickets_controller.rb

SELECT "tickets".* FROM "tickets" ORDER BY "tickets"."created_at" ASC
---
  def index
    @tickets = Ticket.all

    # Filtros
    @tickets = @tickets.where(servicio: params[:servicio]) if params[:servicio].present?
    @tickets = @tickets.where(pago: params[:pago]) if params[:pago].present?
    @tickets = @tickets.where(entrega: params[:entrega]) if params[:entrega].present?

    # Filtrar por rango de fechas de entrega
    if params[:fecha_desde].present?
      fecha_desde = Date.strptime(params[:fecha_desde], '%d/%m/%y') rescue nil
      @tickets = @tickets.where('fecha_entrega >= ?', fecha_desde) if fecha_desde
    end
    if params[:fecha_hasta].present?
      fecha_hasta = Date.strptime(params[:fecha_hasta], '%d/%m/%y') rescue nil
      @tickets = @tickets.where('fecha_entrega <= ?', fecha_hasta) if fecha_hasta
    end

    # Búsqueda por cliente o vehículo
    if params[:buscar].present?
      search_term = "%#{params[:buscar]}%"
      @tickets = @tickets.where('cliente LIKE ? OR vehiculo LIKE ? OR placas LIKE ?',
                              search_term, search_term, search_term)
    end

    # Estadísticas para las gráficas
    @tickets_by_service = Ticket.group(:servicio).count

    # Preparar datos para el timeline de entregas
    @delivery_timeline = @tickets.order(:created_at).map do |ticket|