app/controllers/tickets_controller.rb

SELECT "tickets".* FROM "tickets" WHERE (cliente LIKE '%jorge%' OR vehiculo LIKE '%jorge%' OR placas LIKE '%jorge%')
SELECT "tickets".* FROM "tickets" WHERE "tickets"."servicio" = ?  [["servicio", "Servicio eléctrico"]]
SELECT COUNT(*) AS count_all, "tickets"."servicio" AS tickets_servicio FROM "tickets" GROUP BY "tickets"."servicio"
SELECT "tickets"."id", "tickets"."vehiculo", "tickets"."cliente", "tickets"."servicio", "tickets"."created_at", "tickets"."fecha_entrega", "tickets"."placas" FROM "tickets" ORDER BY "tickets"."created_at" ASC
INSERT INTO "tickets" ("cliente", "vehiculo", "servicio", "created_at", "updated_at", "fecha_ingreso", "placas", "telefono", "correo", "comentarios", "fecha_entrega") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def index
    @tickets = Ticket.all

    # Filtrar por servicio si se especifica
    @tickets = @tickets.where(servicio: params[:servicio]) if params[:servicio].present?

    # Filtrar por rango de fechas de entrega
    if params[:fecha_desde].present?
      @tickets = @tickets.where('fecha_entrega >= ?', params[:fecha_desde])
    end
    if params[:fecha_hasta].present?
      @tickets = @tickets.where('fecha_entrega <= ?', params[:fecha_hasta])
    end

    # Búsqueda por cliente o vehículo
    if params[:buscar].present?
      search_term = "%#{params[:buscar]}%"
      @tickets = @tickets.where('cliente LIKE ? OR vehiculo LIKE ? OR placas LIKE ?',
                              search_term, search_term, search_term)
    end

    # Estadísticas para las gráficas
    @tickets_by_service = Ticket.group(:servicio).count

    # Preparar datos para el timeline de entregas
    @delivery_timeline = Ticket.order(:created_at)
                              .select(:id, :vehiculo, :cliente, :servicio, :created_at, :fecha_entrega, :placas)
                              .map do |ticket|
      # Calcular el progreso y color
      total_days = (ticket.fecha_entrega.to_date - ticket.created_at.to_date).to_i

INSERT INTO "tickets" ("cliente", "vehiculo", "servicio", "created_at", "updated_at", "fecha_ingreso", "placas", "telefono", "correo", "comentarios", "fecha_entrega") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @ticket = Ticket.new(ticket_params)
    @ticket.fecha_ingreso = Time.current
    if @ticket.save

UPDATE "tickets" SET "cliente" = ?, "vehiculo" = ?, "updated_at" = ?, "placas" = ?, "pago" = ? WHERE "tickets"."id" = ?  [["cliente", "Mateo"], ["vehiculo", "Matus"], ["updated_at", "2025-05-14 22:12:09.497147"], ["placas", "654ASD"], ["pago", 1], ["id", 3]]
---
  def update
    if @ticket.update(ticket_params)