app/controllers/tickets_controller.rb

INSERT INTO "tickets" ("cliente", "vehiculo", "servicio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cliente", "VIP001"], ["vehiculo", "bmw x3 azul wrt789"], ["servicio", "a03"], ["created_at", "2024-10-16 14:46:34.592283"], ["updated_at", "2024-10-16 14:46:34.592283"]]
---
  def create
    @ticket = Ticket.new(ticket_params)
    @ticket.fecha_ingreso = Time.current
    if @ticket.save